#+TITLE: Debian Testing (Stretch) install
#+AUTHOR: Mathieu Basille

This is a complete tutorial to install Debian Stretch. Most of the
instructions are general enough to be applied on any computer. Keep in
mind, however, that:
- Hardware configuration (including keyboard layout) is tuned for a
  laptop *DELL XPS 13 (9350)*;
- Keyboard layout is based on QWERTY, and adds extra key combinations
  to enable French characters and accents, as well as most Greek
  letters.
- The installation is geared towards an academic work, primarily based
  on the use of Emacs, R and PostGIS (see *Office* and *R, QGIS and
  PostGIS* sections).
- *Internet admin* mostly deals with remote access of resources offered
  by the University of Florida (and is thus only relevant for UF
  members).


*** The Debian way

Start by downloading an image of the [[https://www.debian.org/devel/debian-installer/][Debian Installer]] for Debian
Testing (Stretch), according to the platform of the computer. A good
choice is the Network install (=netinst=), which will fetch all system
packages directly on-line when installing. In this case, the file to
download is the netinst weekly snapshot for amd64
(=debian-testing-amd64-netinst.iso=). Then check MD5 sums to guarantee
the integrity of the file:

#+BEGIN_SRC sh
md5sum debian-testing-amd64-netinst.iso 
#+END_SRC
#+RESULTS:
  : 0ae2ef8a422522eca17d38bade946ec0  debian-testing-amd64-netinst.iso

The next step is to copy the ISO on a USB flash drive. First check
on which device the flash drive is mounted:

#+BEGIN_SRC sh
df -h
#+END_SRC
#+RESULTS:
  : Filesystem      Size  Used Avail Use% Mounted on
  : /dev/sda1        28G   15G   12G  55% /
  : ...
  : /dev/sda3       204G  195G  2.8G  99% /home
  : tmpfs           789M   40K  789M   1% /run/user/1000
  : /dev/sdb1       7.5G  184K  7.5G   1% /media/<user>/<FLASH>

In this case, this shows that the flash drive is associated to
=sdb1=. We can then use it to overwrite the flash drive with the ISO
(WARNING #1: This formats the entire stick! WARNING #2: Change the
value of =sdb1= accordingly!):

#+BEGIN_SRC sh
sudo dd if=debian-testing-amd64-netinst.iso of=/dev/sdb1
#+END_SRC
#+RESULTS:
  : 587776+0 records in
  : 587776+0 records out
  : 300941312 bytes (301 MB) copied, 104.177 s, 2.9 MB/s

Now unmount the flash drive, and from now on, all other steps will be
on the 'target' computer.

  : sudo umount /dev/sdb1 


